{
    "<BOS>": 0,
    "<SEP>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "<PAD>": 4,
    "N12": 5,
    "N11": 6,
    "N10": 7,
    "N9": 8,
    "N8": 9,
    "N7": 10,
    "N6": 11,
    "N5": 12,
    "N4": 13,
    "N3": 14,
    "N2": 15,
    "N1": 16,
    "L12": 17,
    "L11": 18,
    "L10": 19,
    "L9": 20,
    "L8": 21,
    "L7": 22,
    "L6": 23,
    "L5": 24,
    "L4": 25,
    "L3": 26,
    "L2": 27,
    "L1": 28,
    "S12": 29,
    "S11": 30,
    "S10": 31,
    "S9": 32,
    "S8": 33,
    "S7": 34,
    "S6": 35,
    "S5": 36,
    "S4": 37,
    "S3": 38,
    "S2": 39,
    "S1": 40,
    "0": 41,
    "1": 42,
    "2": 43,
    "3": 44,
    "4": 45,
    "5": 46,
    "6": 47,
    "7": 48,
    "8": 49,
    "9": 50,
    "A": 51,
    "B": 52,
    "C": 53,
    "D": 54,
    "E": 55,
    "F": 56,
    "G": 57,
    "H": 58,
    "I": 59,
    "J": 60,
    "K": 61,
    "L": 62,
    "M": 63,
    "N": 64,
    "O": 65,
    "P": 66,
    "Q": 67,
    "R": 68,
    "S": 69,
    "T": 70,
    "U": 71,
    "V": 72,
    "W": 73,
    "X": 74,
    "Y": 75,
    "Z": 76,
    "a": 77,
    "b": 78,
    "c": 79,
    "d": 80,
    "e": 81,
    "f": 82,
    "g": 83,
    "h": 84,
    "i": 85,
    "j": 86,
    "k": 87,
    "l": 88,
    "m": 89,
    "n": 90,
    "o": 91,
    "p": 92,
    "q": 93,
    "r": 94,
    "s": 95,
    "t": 96,
    "u": 97,
    "v": 98,
    "w": 99,
    "x": 100,
    "y": 101,
    "z": 102,
    "!": 103,
    "\"": 104,
    "#": 105,
    "$": 106,
    "%": 107,
    "&": 108,
    "'": 109,
    "(": 110,
    ")": 111,
    "*": 112,
    "+": 113,
    ",": 114,
    "-": 115,
    ".": 116,
    "/": 117,
    ":": 118,
    ";": 119,
    "<": 120,
    "=": 121,
    ">": 122,
    "?": 123,
    "@": 124,
    "[": 125,
    "\\": 126,
    "]": 127,
    "^": 128,
    "_": 129,
    "`": 130,
    "{": 131,
    "|": 132,
    "}": 133,
    "~": 134,
    "L13": 135,
    "L14": 136,
    "L15": 137,
    "L16": 138,
    "L17": 139,
    "L18": 140,
    "L19": 141,
    "L20": 142,
    "L21": 143,
    "L22": 144,
    "L23": 145,
    "L24": 146,
    "L25": 147,
    "L26": 148,
    "L27": 149,
    "L28": 150,
    "L29": 151,
    "L30": 152,
    "L31": 153,
    "L32": 154,
    "N13": 155,
    "N14": 156,
    "N15": 157,
    "N16": 158,
    "N17": 159,
    "N18": 160,
    "N19": 161,
    "N20": 162,
    "N21": 163,
    "N22": 164,
    "N23": 165,
    "N24": 166,
    "N25": 167,
    "N26": 168,
    "N27": 169,
    "N28": 170,
    "N29": 171,
    "N30": 172,
    "N31": 173,
    "N32": 175,
    "S13": 176,
    "S14": 176,
    "S15": 177,
    "S16": 178,
    "S17": 179,
    "S18": 180,
    "S19": 181,
    "S20": 182,
    "S21": 183,
    "S22": 184,
    "S23": 185,
    "S24": 186,
    "S25": 187,
    "S26": 188,
    "S27": 189,
    "S28": 190,
    "S29": 191,
    "S30": 192,
    "S31": 193,
    "S32": 194
}